; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v1 ?v3)
             (pred_2 ?v10 ?v6)
             (pred_11 ?v1 ?v6)
             (pred_7 ?v4 ?v1 )
	     (pred_6 ?v1)
             (pred_1 ?v12)
             (pred_10 ?v10)
             (pred_12 ?v6)
             (pred_5 ?v1)
             (pred_3 ?v10)
             (pred_4 ?v1)
             (pred_8 ))



(:action op_4
:parameters (?v11 ?v13 ?v2 ?v7)
:precondition (and (pred_1 ?v11) (pred_1 ?v13) (pred_10 ?v2) (pred_12 ?v7)
          (pred_9 ?v11 ?v13) (pred_2 ?v2 ?v7)
                   (pred_11 ?v13 ?v7) (pred_6 ?v11) 
                   (pred_5 ?v13) (pred_3 ?v2))
:effect (and  (pred_4 ?v13) (not (pred_5 ?v13))))


(:action op_1
:parameters (?v11 ?v5)
:precondition (and (pred_1 ?v11) (pred_1 ?v5)
               (pred_6 ?v11) (pred_9 ?v11 ?v5) (pred_4 ?v5))
:effect (and (pred_6 ?v5) (not (pred_6 ?v11))))

(:action op_5
:parameters (?v11 ?v2)
:precondition (and (pred_1 ?v11) (pred_10 ?v2) 
                  (pred_6 ?v11) (pred_7 ?v2 ?v11) (pred_8 ))
:effect (and (pred_3 ?v2)
   (not (pred_7 ?v2 ?v11)) (not (pred_8 ))))


(:action op_3
:parameters (?v11 ?v8 ?v9)
:precondition (and (pred_1 ?v11) (pred_10 ?v8) (pred_10 ?v9)
                  (pred_6 ?v11) (pred_3 ?v9) (pred_7 ?v8 ?v11))
:effect (and (pred_3 ?v8) (pred_7 ?v9 ?v11)
        (not (pred_3 ?v9)) (not (pred_7 ?v8 ?v11))))

(:action op_2
:parameters (?v11 ?v2)
:precondition (and (pred_1 ?v11) (pred_10 ?v2) 
                  (pred_6 ?v11) (pred_3 ?v2))
:effect (and (pred_8 ) (pred_7 ?v2 ?v11) (not (pred_3 ?v2)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_01 obj_07 obj_13 obj_04 obj_12 obj_11 obj_09 obj_06 obj_02
    obj_10 obj_08
    obj_03 obj_05
    )

    (:init
       (pred_8)

       (pred_1 obj_01)
       (pred_1 obj_07)
       (pred_1 obj_13)
       (pred_1 obj_04)
       (pred_1 obj_12)
       (pred_1 obj_11)
       (pred_1 obj_09)
       (pred_1 obj_06)
       (pred_1 obj_02)
       (pred_12 obj_10)
       (pred_12 obj_08)
       (pred_10 obj_03)
       (pred_10 obj_05)

       (pred_9 obj_01 obj_04)
       (pred_9 obj_01 obj_07)
       (pred_9 obj_07 obj_12)
       (pred_9 obj_07 obj_13)
       (pred_9 obj_07 obj_01)
       (pred_9 obj_13 obj_11)
       (pred_9 obj_13 obj_07)
       (pred_9 obj_04 obj_09)
       (pred_9 obj_04 obj_12)
       (pred_9 obj_04 obj_01)
       (pred_9 obj_12 obj_06)
       (pred_9 obj_12 obj_11)
       (pred_9 obj_12 obj_07)
       (pred_9 obj_12 obj_04)
       (pred_9 obj_11 obj_02)
       (pred_9 obj_11 obj_13)
       (pred_9 obj_11 obj_12)
       (pred_9 obj_09 obj_06)
       (pred_9 obj_09 obj_04)
       (pred_9 obj_06 obj_02)
       (pred_9 obj_06 obj_12)
       (pred_9 obj_06 obj_09)
       (pred_9 obj_02 obj_11)
       (pred_9 obj_02 obj_06)
       (pred_5 obj_02)
       (pred_5 obj_09)
       (pred_11  obj_02 obj_10)
       (pred_11  obj_09 obj_08)
       (pred_4 obj_01)
       (pred_4 obj_07)
       (pred_4 obj_13)
       (pred_4 obj_04)
       (pred_4 obj_12)
       (pred_4 obj_11)
       (pred_4 obj_06)

       (pred_2  obj_03 obj_10)
       (pred_2  obj_05 obj_08)
       (pred_7 obj_03 obj_04)
       (pred_7 obj_05 obj_07)
       (pred_6 obj_11)
    )

    (:goal (and
       (pred_7 obj_05 obj_01)
    ))
(:constraints
  (always (not (pred_6 obj_13)))
)
)

; plan
1. (op_1 obj_11 obj_12)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_12)
   goals met: 0 of 1
2. (op_1 obj_12 obj_07)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_07)
   goals met: 0 of 1
3. (op_5 obj_07 obj_05)
   deleted: (pred_7 obj_05 obj_07) (pred_8)
   added: (pred_3 obj_05)
   goals met: 0 of 1
4. (op_1 obj_07 obj_01)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_01)
   goals met: 0 of 1
5. (op_2 obj_01 obj_05)
   deleted: (pred_3 obj_05)
   added: (pred_8) (pred_7 obj_05 obj_01)
   goals met: 1 of 1
